using UnityEngine;

public class TODO : MonoBehaviour
{
    ///
    /// 
    /// 
    /// 에러
    /// 
    /// - FightScene 내부의 XROrigin이 플레이어별로 각각 다르게 할당되고,
    ///     상대방의 XROrigin은 비활성화 되게 설정해야함.
    ///     일단 같은 시야에서 움직이는건 적용됨
    /// + NetworkVariable 쓰기 권한 문제 해결
    /// 
    ///
    /// 해야할 일
    /// 
    /// 발표 자료 필요
    /// : 아이템 제작 과정
    ///     - 아이템 실제 데이터를 Json으로 저장'
    ///     - Meshroom에서 저장이 완료되면 프리팹 이름을 Json에 있는 oid로 바꾸고
    ///         - test.glb가 생성되면 oid.glb로 이름 변경
    ///     - 실제 소환할 수 있게, Json 정보로 저장해놓기...
    ///     - 지금 test.json을 읽어서 불러오는 프리팹을 persistants어쩌구 경로로 바꾸기. -> objects 폴더로 이동해서 불러오기
    ///     
    ///     *** 진짜 필요한 자료
    ///         1. 아이템 사진 찍기
    ///         2. 사진 찍은 물체 진짜로 glb 파일로 만들고 인게임에서 띄우기
    ///         3. 저장된 Json 파일 형태.. -> 이런 형태로 DB에 저장 됩니다~
    ///         
    /// : 실제 플레이 장면
    ///     *** 멀티가 가능하고, 상대방이 저런식으로 움직인다~
    ///         1. 움직이는 동영상만 첨부
    ///  
    /// : 멀티 플레이 장면...(이동만 동기화)
    ///     *** 이미 찍었으니까 영상에 편집해서 짧게 넣기
    ///     
    /// 
    /// 0. 맵에 있는 스테미나 구현
    /// 1. 투척형, 소모형 아이템 인게임 확인
    /// 2. 시계 날아가는거,, 원래 있던 위치보다 얼마나 멀어졌는지,, 확인해서 리셋하고 턴 넘김
    /// 
    /// 3. 카드 위에 레이 쏘면 뜨는 고스트 오브젝트 위치 바꾸기(카드가 안보임)
    ///  - 카드 확대 후 고스트 오브젝트 생기게 하기
    /// 
    /// + 게임 오브젝트 전부에 NetworkObject 붙여서 동기화 해야함
    ///  
}
